#include <iostream>
#include<vector>
#include<queue>
#include<set>
using namespace std;
/* Город будущего застроен небоскребами, для передвижения между которыми и парковки транспорта многие тройки небоскребов соединены треугольной подушкой из однополярных магнитов. Каждая подушка соединяет ровно 3 небоскреба и вид сверху на нее представляет собой треугольник, с вершинами в небоскребах. Это позволяет беспрепятственно передвигаться между соответствующими небоскребами. Подушки можно делать на разных уровнях, поэтому один небоскреб может быть соединен различными подушками с парами других, причем два небоскреба могут соединять несколько подушек (как с разными третьими небоскребами, так и с одинаковым). Например, возможны две подушки на разных уровнях между небоскребами 1, 2 и 3, и, кроме того, магнитная подушка между 1, 2, 5.

Система магнитных подушек организована так, что с их помощью можно добираться от одного небоскреба, до любого другого в этом городе (с одной подушки на другую можно перемещаться внутри небоскреба), но поддержание каждой из них требует больших затрат энергии.

Требуется написать программу, которая определит, какие из магнитных подушек нельзя удалять из подушечной системы города, так как удаление даже только этой подушки может привести к тому, что найдутся небоскребы из которых теперь нельзя добраться до некоторых других небоскребов, и жителям станет очень грустно.
Формат входных данных
В первой строке входного файла находятся числа N и M — количество небоскребов в городе и количество работающих магнитных подушек соответственно (3 ≤ N ≤ 100000, 1 ≤ M ≤ 100000). В каждой из следующих M строк через пробел записаны три числа — номера небоскребов, соединенных подушкой. Небоскребы пронумерованы от 1 до N.

Гарантируется, что имеющиеся воздушные подушки позволяют перемещаться от одного небоскреба до любого другого.
Формат результата
Выведите в выходной файл сначала количество тех магнитных подушек, отключение которых невозможно без нарушения сообщения в городе, а потом их номера. Нумерация должна соответствовать тому порядку, в котором подушки перечислены во входном файле. Нумерация начинается с единицы.
 Входные данные:
3 1
1 2 3
 Результат работы:
1
1
 Входные данные:
3 2
1 2 3
3 2 1
 Результат работы:
0
 Входные данные:
5 4
1 2 3
2 4 3
1 2 4
3 5 1
 Результат работы:
1
4
*/
vector<int> visited;
vector<int> d, up, ArtPoints;
void dfs (int v, vector<vector<int> > &G, int &time, int p = -1)
{
    visited[v] = 1;
    d[v] = up[v] = time++;
    int children = 0;
    for (int i = 0; i < G[v].size(); i++)
    {
        int to = G[v][i];
        if (to == p)  continue;
        if (visited[to])
            up[v] = min (up[v], d[to]);
        else
        {
            dfs (to, G, time, v);
            up[v] = min (up[v], up[to]);
            if ((up[to] >= d[v]) && (p != -1)) ArtPoints[v] = 1;
            children++;
        }
    }
    if ((p == -1) && (children > 1)) ArtPoints[v] = 1;
}

int main() {
    int n, m;
    cin>>n>>m;
    int Vertices = n + m;
    visited.assign(300100, 0);
    d.assign(300100, 0);
    up.assign(300100, 0);
    ArtPoints.assign(300100, 0);

    vector<vector<int> > G(300100);
    for(int i = 1; i <= m; ++i){
        int t_1, t_2, t_3;
        cin>>t_1>>t_2>>t_3;
        G[n + i].push_back(t_1);
        G[t_1].push_back(n + i);
        G[n + i].push_back(t_2);
        G[t_2].push_back(n + i);
        G[n + i].push_back(t_3);
        G[t_3].push_back(n + i);
    }

    int time = 1;
    for(int i = 1; i <= Vertices; ++i){
        if(!visited[i])
            dfs(i, G, time);
    }

    int countArtPoints = 0;

    for(int i = n + 1; i <= Vertices; ++i){
        if(ArtPoints[i])
            countArtPoints++;
    }

    cout<<countArtPoints<<endl;

    if(countArtPoints){
        for(int i = n + 1; i <= Vertices; ++i){
            if(ArtPoints[i]){
                cout<<i - n<<" ";
            }
        }
        cout<<endl;
    }

    return 0;
}
